Конфигурация/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Велосипеды</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БаллыНаСписание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииПродажи</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ДоставкиИОплаты/ДоставкиИОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоставкиИОплаты</name>
  <resources>
    <name>КоличествоНеоплаченныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеоплаченнаяСуммаЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/БонусныеБаллыКлиентов/БонусныеБаллыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллыКлиентов</name>
  <resources>
    <name>СуммаБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/Заказ/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(Клиент) Тогда

		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите клиента";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Клиент";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	МаксимальнаяДоляОплатыБаллами = Константы.МаксимальнаяДоляОплатыБаллами.Получить();

	Если БаллыНаСписание <> 0 Тогда
		
		Если БаллыНаСписание > Цена Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Списываемые баллы превышают цену заказа";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = "БаллыНаСписание";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Цена <> 0 Тогда
			
			ДоляБалловОтЦены = БаллыНаСписание / Цена * 100;
			ДопустимоеКоличествоБаллов = Цена * МаксимальнаяДоляОплатыБаллами / 100;
			ДопустимоеКоличествоБалловДваЗнака = ОбщиеФункцииКлиентСервер.ОбрезатьДробнуюЧастьДоДвухЗнаков(ДопустимоеКоличествоБаллов);
			
			Если ДоляБалловОтЦены > МаксимальнаяДоляОплатыБаллами Тогда
				
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Превышена максимальная доля баллов: %1%%. Для цены %2 максимальное число баллов: %3", МаксимальнаяДоляОплатыБаллами, Цена, ДопустимоеКоличествоБалловДваЗнака);
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = "БаллыНаСписание";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДоставкиИОплаты
	Движения.ДоставкиИОплаты.Записывать = Истина;
	ДвижениеНеоплаченныеЗаказы = Движения.ДоставкиИОплаты.Добавить();
	ДвижениеНеоплаченныеЗаказы.Период = Дата;
	ДвижениеНеоплаченныеЗаказы.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНеоплаченныеЗаказы.ОснованиеПлатежа = Ссылка;
	ДвижениеНеоплаченныеЗаказы.Ответственный = Курьер;
	ДвижениеНеоплаченныеЗаказы.КоличествоНеоплаченныхЗаказов = 1;
	ДвижениеНеоплаченныеЗаказы.НеоплаченнаяСуммаЗаказов = СуммаЗаказа;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;

	Для Каждого ТекСтрокаПозицииПродажи из ПозицииПродажи Цикл

		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Товар = ТекСтрокаПозицииПродажи.Товар;
		ДвижениеПродажи.Количество = ТекСтрокаПозицииПродажи.Количество;
		ДвижениеПродажи.Клиент = Клиент;
		ДвижениеПродажи.Сумма = ТекСтрокаПозицииПродажи.СуммаПозиции;

	КонецЦикла;
	
	// регистр БонусныеБаллыКлиентов
	ОбработатьБонусныеБаллы(Отказ);
	
КонецПроцедуры

#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьБонусныеБаллы(Отказ)

	Движения.БонусныеБаллыКлиентов.Записывать = Истина;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	БаллыКНакоплению = ОбщийМодульВызовСервера.ПолучитьБаллыКНакоплениюЧерезКлиента(
		Новый Граница(МоментВремени(), ВидГраницы.Исключая),
		Клиент,
		Дата,
		Цена
	);

	Если БаллыКНакоплению <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыКНакоплению;
		
	КонецЕсли;
	
	Если БаллыНаСписание <> 0 Тогда
		
		Движение = Движения.БонусныеБаллыКлиентов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.СуммаБаллов = БаллыНаСписание;
		
	КонецЕсли;
	
	Движения.Записать();

	ОтрицательнаяСуммаБалловОстаток = ОбщийМодульВызовСервера.ПолучитьОтрицательнуюСуммуБалловНаПериод(
		Новый Граница(МоментВремени(),
		ВидГраницы.Включая),
		Клиент
	);

	Если ЗначениеЗаполнено(ОтрицательнаяСуммаБалловОстаток) Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
			"Доступно баллов к списанию: %1",
			ОтрицательнаяСуммаБалловОстаток + БаллыНаСписание
		);
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "БаллыНаСписание";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
